app/controllers/posts_controller.rb

  def show
    if params[:author_id]
      @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "My First"], ["created_at", "2016-08-28 22:58:39.719316"], ["updated_at", "2016-08-28 22:58:39.719316"]]